
// ... এইটা হলো ছড়িয়ে দেওয়া নাম spreed 151 / 5,000
// স্প্রেড অপারেটর জাভাস্ক্রিপ্ট স্প্রেড অপারেটর (...) আমাদেরকে একটি বিদ্যমান অ্যারে বা অবজেক্টের সমস্ত বা অংশ দ্রুত অন্য অ্যারে বা অবজেক্টে কপি করতে দেয়।

// const numbers = [45, 78, 69, 45, 78, 64, 7];
// console.log(...numbers);


//এইটা হলো সবচেয়ে বড় সংখ্যা দেখার নিয়াম: 
/* const max = Math.max(...numbers);

console.log(max); */

// এই array এর মধ্যে আমরা যোগ পারবো। 
const numbers = [45, 78, 69, 45, 78, 64, 7];
const secondArray = [...numbers, 99, 111, 77, 66];
// numbers.push(1000); এইটা হবে না। 
console.log(secondArray);
